/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
  German translation by colorenz
*/

// error sheet
"invalid-input" = "Ein oder mehrere Eingabefelder sind fehlerhaft";
"is-required" = "Ist erforderlich";
"no-pattern" = "nicht dem erforderlichen Format entspricht";

// required fields text
"required-note" = "*Erforderliche Felder";

//buttons
"button-cancel" = "Abbrechen";
"button-more-info" = "Mehr Informationen";
"button-ok" = "OK";
"button-select" = "Auswählen";

//default text
"default-title" = "Eine wichtige Nachricht";
"default-message" = "Diese ist eine wichtige Nachrichten\n\n Bitte lesen Sie diese";
"help-hover" = "Klicken Sie für weitere Informationen";

"Confirm" = "Bestätigen";

"confirmation-failed" = "Bestätigung fehlgeschlagen <br>Werte stimmen nicht überein";

//constructor kit labels
"ck-welcome"            = "Willkommen beim swiftDialog Builder";
"ck-welcomeinfo"        = "Wählen Sie die zu ändernden Eigenschaften auf der linken Seite aus. swiftDialog wird aktualisiert, um die Änderungen in Echtzeit anzuzeigen.";
"ck-basic"              = "Basic";
"ck-content"            = "Inhalt";
"ck-window"             = "Fenster";
"ck-sidebar"            = "Seitenleiste";
"ck-dataentry"          = "Dateneingabe";
"ck-buttons"            = "Tasten";
"ck-advanced"           = "Fortschrittlich";
"ck-listitems"          = "Elemente auflisten";
"ck-images"             = "Bilder";
"ck-media"              = "Medien";
"ck-output"             = "Ausgabe";
"ck-jsonoutput"         = "JSON-Ausgabe";
"ck-quit"               = "Aufhören";
"ck-exportcommand"      = "Befehl exportieren";
"ck-title"              = "Titel";
"ck-colour"             = "Farbe";
"ck-reset"              = "Zurücksetzen";
"ck-fontsize"           = "Schriftgröße: ";
"ck-value"              = "Wert:";
"ck-message"            = "Nachricht";
"ck-textalignmnet"      = "Textausrichtung";
"ck-verticalposition"   = "Vertikale Position";
"ck-windowheight"       = "Fensterhöhe";
"ck-heightvalue"        = "Höhenwert:";
"ck-windowwidth"        = "Fensterbreite";
"ck-widthvalue"         = "Breitenwert:";
"ck-windowproperties"   = "Fenstereigenschaften";
"ck-presetsizes"        = "Voreingestellte Größen";
"ck-small"              = "Klein";
"ck-big"                = "Groß";
"ck-screenblur"         = "Bildschirmhintergrund unscharf";
"ck-movable"            = "Beweglich";
"ck-forceontop"         = "Force on Top";
"ck-progressbar"        = "Fortschrittsanzeige";
"ck-progressvalue"      = "Fortschrittswert:";
"ck-progresstext"       = "Fortschrittstext:";
"ck-bannerimage"        = "Bannerbild";
"ck-select"             = "Wählen";
"ck-watermark"          = "Wasserzeichen";
"ck-fill"               = "Füllen";
"ck-alpha"              = "Alpha";
"ck-scale"              = "Skala";
"ck-position"           = "Position";
"ck-icon"               = "Symbol";
"ck-visible"            = "Sichtbar";
"ck-centred"            = "zentriert";
"ck-select"             = "Wählen";
"ck-iconsize"           = "Symbolgröße";
"ck-sizevalue"          = "Größenwert:";
"ck-overlay"            = "Überlagerung";
"ck-infobox"            = "Infobox";
"ck-infotext"           = "Infotext";
"ck-infotextlabel"      = "Infotext";
"ck-button1"            = "Knopf 1";
"ck-button2"            = "Taste2";
"ck-infobuttonlabel"    = "Info-Button";
"ck-quitoninfo"         = "Beenden bei Info";
"ck-label"              = "Etikette: ";
"ck-infobuttonaction"   = "Aktion der Info-Schaltfläche: ";
"ck-autoplay"           = "Automatisches Abspielen";
"ck-autoplayseconds"    = "Sekunden automatisch abspielen";
"ck-path"               = "Weg";
"ck-caption"            = "Bildbeschriftung";
"ck-statustext"         = "Statustext";
"ck-status"             = "Status";
"ck-formatjson"         = "Ausgabe als JSON formatieren";
"ck-textfields"         = "Textfelder";
"ck-show"               = "Show";
"ck-required"           = "Erforderlich";
"ck-secure"             = "Sicher";
"ck-prompt"             = "Prompt";
"ck-regex"              = "Regex";
"ck-regexerror"         = "Regex-Fehler";
"ck-select"             = "Wählen";
"ck-checkbox"           = "Kontrollkästchen";
"ck-video"              = "Video";
"ck-filename"           = "Dateiname";
"ck-web"                = "Netz";
"ck-url"                = "URL";
"ck-disabled"           = "Deaktiviert";
"ck-enabled"            = "Ermöglicht";
